irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_pwr_4099_IUT.c
  CS_CMM_PROBE_NODE_STMT(137,4,0) ((void)0);
  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x7000) - ((uint32_t)0x40000000)) + 0x00) * 32) + (0x08 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(137,3,1) 
 CODESCROLL_FUNC_END(230, 16, 138) } CODESCROLL_FUNC_END_RBRACE 







void PWR_PVDCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(231, (231, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable642,628) 

  
  CS_CMM_PROBE_NODE_STMT(137,2,0) ((void)0);
  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x7000) - ((uint32_t)0x40000000)) + 0x00) * 32) + (0x04 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(137,1,1) 
 CODESCROLL_FUNC_END(231, 16, 151) } CODESCROLL_FUNC_END_RBRACE 
/* # 167 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_pwr.c"*/
void PWR_PVDLevelConfig(uint32_t PWR_PVDLevel)
{ CODESCROLL_FUNC_BEGIN(232, (232, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable643,629) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable644,137,0,0)

  uint32_t tmpreg = 0;

  ((void)0);
  tmpreg = ((PWR_TypeDef *) (((uint32_t)0x40000000) + 0x7000))->CR;

  tmpreg &= ((uint32_t)0xFFFFFF1F);

  tmpreg |= PWR_PVDLevel;

  ((PWR_TypeDef *) (((uint32_t)0x40000000) + 0x7000))->CR = tmpreg;

CS_CMM_PROBE_NODE_STMT(138,7,1) 
 CODESCROLL_FUNC_END(232, 16, 179) } CODESCROLL_FUNC_END_RBRACE 







void PWR_WakeUpPinCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(233, (233, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable645,630) 

  
  CS_CMM_PROBE_NODE_STMT(138,6,0) ((void)0);
  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x7000) - ((uint32_t)0x40000000)) + 0x04) * 32) + (0x08 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(138,5,1) 
 CODESCROLL_FUNC_END(233, 16, 192) } CODESCROLL_FUNC_END_RBRACE 
/* # 206 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_pwr.c"*/
void PWR_EnterSTOPMode(uint32_t PWR_Regulator, uint8_t PWR_STOPEntry)
{ CODESCROLL_FUNC_BEGIN(234, (234, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable646,631) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable647,138,4,0)

  uint32_t tmpreg = 0;

  ((void)0);
  ((void)0);


  tmpreg = ((PWR_TypeDef *) (((uint32_t)0x40000000) + 0x7000))->CR;

  tmpreg &= ((uint32_t)0xFFFFFFFC);

  tmpreg |= PWR_Regulator;

  ((PWR_TypeDef *) (((uint32_t)0x40000000) + 0x7000))->CR = tmpreg;

  *(volatile uint32_t *) ((uint32_t)0xE000ED10) |= ((uint32_t)0x00000004);


  
  CS_CMM_PROBE_NODE_STMT(138,3,1) if(PWR_STOPEntry == ((uint8_t)0x01))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable648,632) 

    
    CS_CMM_PROBE_NODE_STMT(138,2,2) __WFI();
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable649,633) 

    
    CS_CMM_PROBE_NODE_STMT(138,1,3) __WFE();
  }


  
  CS_CMM_PROBE_NODE_STMT(138,0,4) *(volatile uint32_t *) ((uint32_t)0xE000ED10) &= ((uint32_t)0xFFFFFFFB);

CS_CMM_PROBE_NODE_STMT(139,7,5) 
 CODESCROLL_FUNC_END(234, 16, 238) } CODESCROLL_FUNC_END_RBRACE 






void PWR_EnterSTANDBYMode(void)
{ CODESCROLL_FUNC_BEGIN(235, (235, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable650,634) 

  
  CS_CMM_PROBE_NODE_STMT(139,6,0) ((PWR_TypeDef *) (((uint32_t)0x40000000) + 0x7000))->CR |= ((uint32_t)0x00000004);

  ((PWR_TypeDef *) (((uint32_t)0x40000000) + 0x7000))->CR |= ((uint32_t)0x00000002);

  *(volatile uint32_t *) ((uint32_t)0xE000ED10) |= ((uint32_t)0x00000004);





  __WFI();

CS_CMM_PROBE_NODE_STMT(139,5,1) 
 CODESCROLL_FUNC_END(235, 16, 259) } CODESCROLL_FUNC_END_RBRACE 
/* # 270 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_pwr.c"*/
FlagStatus PWR_GetFlagStatus(uint32_t PWR_FLAG)
{ CODESCROLL_FUNC_BEGIN(236, (236, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable651,635) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable652,139,4,0)

  FlagStatus bitstatus = RESET;

  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(139,3,1) if ((((PWR_TypeDef *) (((uint32_t)0x40000000) + 0x7000))->CSR & PWR_FLAG) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable653,636) 
    
    CS_CMM_PROBE_NODE_STMT(139,2,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable654,637) 
    
    CS_CMM_PROBE_NODE_STMT(139,1,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(139,0,4) 
   CODESCROLL_FUNC_END(236, 16, 285) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 296 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_pwr.c"*/
void PWR_ClearFlag(uint32_t PWR_FLAG)
{ CODESCROLL_FUNC_BEGIN(237, (237, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable655,638) 

  
  CS_CMM_PROBE_NODE_STMT(140,7,0) ((void)0);

  ((PWR_TypeDef *) (((uint32_t)0x40000000) + 0x7000))->CR |= PWR_FLAG << 2;

CS_CMM_PROBE_NODE_STMT(140,6,1) 
 CODESCROLL_FUNC_END(237, 16, 302) } CODESCROLL_FUNC_END_RBRACE 
